of70/tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{

    inlet_top
    {
       type            zeroGradient;
    }
    
    inlet_down
    {
      type            zeroGradient;
    }

    walls
    {
        type            fixedValue;
        value           uniform -0.14;
    }

    outlet_left
    {
         type            zeroGradient;
    }

    outlet_right
    {
        type            zeroGradient;
    }
    
    "(top|base)"
    {
        type            empty;
    }  
    
}

// ************************************************************************* //
